# RailingSystemHasTopRail Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RailingSystemHasTopRail Property
ParameterTypeId Class See Also
---
"Use Top Rail": Whether railing has top rail
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemHasTopRail { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemHasTopRail As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemHasTopRail {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace